{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "O",
    "1": "B-CREDIT_CARD",
    "2": "I-CREDIT_CARD",
    "3": "B-PHONE",
    "4": "I-PHONE",
    "5": "B-EMAIL",
    "6": "I-EMAIL",
    "7": "B-PERSON_NAME",
    "8": "I-PERSON_NAME",
    "9": "B-DATE",
    "10": "I-DATE",
    "11": "B-CITY",
    "12": "I-CITY",
    "13": "B-LOCATION",
    "14": "I-LOCATION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "B-CITY": 11,
    "B-CREDIT_CARD": 1,
    "B-DATE": 9,
    "B-EMAIL": 5,
    "B-LOCATION": 13,
    "B-PERSON_NAME": 7,
    "B-PHONE": 3,
    "I-CITY": 12,
    "I-CREDIT_CARD": 2,
    "I-DATE": 10,
    "I-EMAIL": 6,
    "I-LOCATION": 14,
    "I-PERSON_NAME": 8,
    "I-PHONE": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
